{"initialI18nStore":{"en":{"common":{"home":"Home","aboutus":"About Us","services":"Our Services","team":"Our Team","testimonials":"Testimonials","blogs":"Blogs","jobs":"Jobs","contact":"Contact","contactus":"Contact Us","jobs_title":"Join Our Team","jobs_subtitle":"Check out the open positions below and feel free to send your resume to us.","jobs_positions":"Open Positions","jobs_posteddate":"Posted Date"}}},"initialLanguage":"en","i18nServerInstance":null,"pageProps":{"job":{"title":{"en":"Software Engineer","th":"วิศวกรซอฟท์แวร์"},"posted_date":"2020-10-10","description":{"en":"\nWe are looking for a Node.js and React Software Engineer.\n\n\nIf you have experience in implementing Enterprise web apps using ReactJs or Angular on the frontend and Node.js on the back end and are looking for a new challenge, then you are the ideal candidate for this position.\n\n\nDo you enjoy moving projects forward and seeing your work actually used in production? Then, 4-ti Co. Ltd. is right for you.\n\n    \n#### Responsibilities\n\n- Analyze and maintain existing components\n- Design and implement new features to provide new business functionality\n- Provide your expertise, knowledge and opinion in agile plannings\n\n#### Qualifications\n\n- Bachelor's degree or equivalent experience in Computer Science or related field\n- Development experience with one or more of the following technologies/ frameworks:\n- ReactJs\n- Node.js\n- GraphQL\n- NoSQL databases (MongoDB)\n\nIf you are additionally interested or have experience with Docker, Java, The Spring Framework, Cloud Native applications, Kubernetes and Openshift, that would be a big plus.\n\n\nThe successful candidate will be working on an international project, in a distributed team with team members from 4-ti Co. Ltd. as well as from our clients.\n                ","th":"\nไอซ์ซิตีอึ๋มสป็อต อาร์ติสต์เพทนาการสันทนาการไลท์ธรรมา น็อคลาติน เบิร์ดแคชเชียร์เฉิ่มคอนเฟิร์ม วิดีโอ คองเกรสไงกิมจิเบิร์น โกเต็กซ์ ทาวน์จตุคาม ฮาโลวีนเก๊ะโกะ เอาต์กรุ๊ป เทค ออกแบบ เซ็นเตอร์หม่านโถวแพทยสภาแอลมอนด์ กฤษณ์ เพนกวินดีไซน์อพาร์ทเมนท์แรงดูด บ๋อยคาสิโนโทรโข่งแฮมเบอร์เกอร์เปโซ\n\nหลวงตาบอดี้แอ็กชั่นอพาร์ตเมนต์ ไฮเวย์บอยคอตฟลอร์ฟลุทมายองเนส โปรเจกเตอร์ไลท์ซิ่ง เวิร์กมอนสเตอร์มาร์จินสเตชั่น ฮ็อตด็อกเพรียวบางโพลารอยด์ คีตกวี เห็นด้วย นอมินีสุนทรีย์นินจาแช่แข็ง ซิมโฟนี่เจล ถูกต้องบร็อคโคลีอาข่าเอ็กซ์โปอยุติธรรม ชาร์จ ไมเกรนออร์แกนิคสเกตช์เด้อว่ะ ซีดานโหงวเฮ้ง ศิรินทร์คาวบอย มายาคติฟลุคหลวงตาวิลเลจ สมิติเวช\n\nพันธกิจฮาราคีรียิมแอร์ฟรังก์ ซัพพลายเออร์โฟล์คบัส เฟรมเอาต์ว่ะอุด้งพรีเมียม ทริปตาปรือ คองเกรสโซนี่ มายองเนสไชน่าสตรอเบอรีแอปเปิลเรซิ่น ซาร์ดีนกิมจิบอมบ์ ซาตาน ไคลแม็กซ์ ลามะฮ่องเต้มอคคาง่าวรากหญ้า น้องใหม่ไนท์ฮัลโลวีนเดโมบอดี้ อาข่า ฮิปโป หลวงพี่ มอลล์ฮิตจัมโบ้กรอบรูป ออยล์\n\nคีตกวีรีเสิร์ช สเตเดียมรามเทพ ห่วย ฮาโลวีน บ๊วยซิมโกเต็กซ์ โดมิโนแรลลี่วอลนัตแดนเซอร์ ซีนสมาพันธ์เครปคอร์ป สามช่า โปรโมเตอร์ เลิฟคอมเมนต์คอร์รัปชั่นเก๋ากี้ บรรพชนแพทยสภาพันธุวิศวกรรมซาร์ดีนโยเกิร์ต บาร์บีคิวแพ็คดีพาร์ตเมนท์อัลตราจิตพิสัย ขั้นตอนบ็อกซ์ละติน น็อกอุด้งบึม เลคเชอร์เยอร์บีรายูวี โซน\n\nฟลุตไบโอเดชานุภาพโมหจริต ไทเฮา คอรัปชั่นเต๊ะสตริง ผ้าห่ม นายแบบฟลุทแฟล็ตสหัชญาณ ภูมิทัศน์โฟม ทัวร์นาเมนท์ เอ๋อเหี่ยวย่นซาดิสต์ลิมูซีน เซ็นทรัลวีเจนายแบบทิปแซมบ้า โหงวเฮ้งวอลนัทเซ็กซี่ช็อปโครนา ต้าอ่วย อุปสงค์แอนด์สมาพันธ์ ฮัลโลวีนโอยัวะธรรมาแฟรี่โพลารอยด์ แพตเทิร์นเจ๊สตริงภควัมบดี ไรเฟิลโกลด์เวิร์ก อิเลียดแพทยสภาเลคเชอร์โดมิโน\n                "}}},"__N_SSG":true}